emacs/.emacs.d/Readme.org
* UI
:properties:
:header-args+: :tangle "./lisp/setup-ui.el"
:end:

UI configuration module automatically tangled in =./lisp/setup-ui.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-ui.el --- UI configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src
** Minimalistic UI
*** No menu and toolbar

#+begin_src emacs-lisp
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
#+end_src

*** No welcome screen

#+begin_src emacs-lisp
(setq  inhibit-startup-message t)
#+end_src

*** Make fringe smaller

#+begin_src emacs-lisp
  (if (fboundp 'fringe-mode)
      (fringe-mode 2))
#+end_src
** All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src
** Theme
Using moe theme dark all the day
#+begin_src emacs-lisp
  (use-package doom-themes

    :config

    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
    ;; may have their own settings.
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)
    ;;(doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (with-eval-after-load 'org-mode
        (doom-themes-org-config))
    )
#+end_src
** Mode line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode))
#+end_src

** Font

#+begin_src emacs-lisp
  (defun nc/setup-font ()
    "Set up font height"
    (interactive)
    (when is-linux
      (set-frame-font "Jetbrains Mono 13" nil t))
    (when is-mac
      (if (> (display-pixel-width) 2500)
          (set-frame-font "Jetbrains Mono 16" nil t)
          (set-frame-font "Jetbrains Mono 14" nil t)))
    (when is-windows
      (set-frame-font "Consolas" nil t))
    )

  (when has-gui
    (add-hook 'after-init-hook #'nc/setup-font))
#+end_src

* Key Bindings
:properties:
:header-args+: :tangle "./lisp/setup-keys.el"
:end:
Key bindings configuration module automatically tangled in =./lisp/setup-keys.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-keys.el --- Key Bindings module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Global Key Bindings
Some Emacs Global Bindings are redefined here.
#+begin_src emacs-lisp
  ;; Unbind unneeded keys
  (global-set-key (kbd "C-z") nil)
  (global-set-key (kbd "M-z") nil)
  (global-set-key (kbd "C-x C-z") nil)
  (global-set-key (kbd "M-o") nil)


  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C--") #'text-scale-decrease)

  ;; Prefer backward-kill-word over Backspace
  (global-set-key (kbd "C-w") #'backward-kill-word)
  (global-set-key (kbd "C-x C-k") #'kill-region)

  (global-set-key (kbd "C-x C-r") #'recentf-open-files)

  ;; Move up/down paragraph
  (global-set-key (kbd "M-n") #'forward-paragraph)
  (global-set-key (kbd "M-p") #'backward-paragraph)

  ;; Goto Line
  ;;(global-set-key (kbd "M-g") #'goto-line)

  ;; Functions
  (global-set-key (kbd "<f5>") #'revert-buffer)
  (global-set-key (kbd "<f6>") #'treemacs)
  (global-set-key (kbd "C-<f6>") #'treemacs-select-window)
  (global-set-key (kbd "<f9>") #'my/capture-interruption-task)
  (global-set-key (kbd "<f11>") #' nc/maximize-or-split-window-vertically)
  (global-set-key (kbd "C-<f11>") #'nc/split-window-horizontally)
  (global-set-key (kbd "<f12>") #'org-agenda)

  ;; Tools alt-[0-9]
  (global-set-key (kbd "M-0") #'nc/maximize-or-split-window-vertically)
  (global-set-key (kbd "M-1") #'vterm-toggle)
  (global-set-key (kbd "M-2") #'eshell-toggle)
  (global-set-key (kbd "M-5") #'magit-log-buffer-file)

#+end_src
** Hydra

#+begin_src emacs-lisp
  (use-package hydra
    :ensure t
    :custom
    (hydra-default-hint nil))

  (use-package major-mode-hydra
    :ensure t)

  ;; Pretty Hydra
  (use-package pretty-hydra
    :ensure t)
#+end_src
*** nc-hydra-insert 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-insert (:foreign-keys warn :title "Insert" :quit-key "q" :exit t)
    ("Insert"
     (("d" nc/insert-datestamp-inactive "Date InActive")
      ("D" nc/insert-datestamp "Date Active")
      ("p" nc/generate-password "Password")
      ("u" nc/uuid "UUID"))

     "Snippet"
     (("y" consult-yasnippet "Yasnippet")
      ("Y" yankpad-insert "Yankpad"))))
#+end_src

*** nc-hydra-goto 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-goto (:foreign-keys warn :title "Goto" :quit-key "q" :exit t)
    ("Configuration"
     ((";" nc/goto-emacs-config "Emacs Config"))

      "Personal Files"
      (("i" nc/goto-inbox "Inbox")
       ("p" nc/goto-my-credentials "Passwords"))

     "Personal Dirs"
     (("A" nc/goto-archives-dir "Archives")
      ("N" nc/goto-notes-dir "Notes")
      ("T" nc/goto-templates-dir "Templates"))))
#+end_src

*** nc-hydra-toggles 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-toggle
    (:color amaranth :quit-key "q" :title "Toggles")
    ("Basic"
     (("n" linum-mode "line number" :toggle t)
      ("w" whitespace-mode "whitespace" :toggle t)
      ;;("W" whitespace-cleanup-mode "whitespace cleanup" :toggle t)
      ("r" rainbow-mode "rainbow" :toggle t))
     "Highlight"
     (("l" hl-line-mode "line" :toggle t))
     "Coding"
     (("p" smartparens-mode "smartparens" :toggle t)
      ("P" smartparens-strict-mode "smartparens strict" :toggle t)
      ("S" show-smartparens-mode "show smartparens" :toggle t)
      ("e" eldoc-mode "eldoc" :toggle t))
     "Emacs"
     (("D" toggle-debug-on-error "debug on error" :toggle (default-value 'debug-on-error))
      ("X" toggle-debug-on-quit "debug on quit" :toggle (default-value 'debug-on-quit)))))
#+end_src
*** hydra windows
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-windows
      (:color amaranth :quit-key "q" :title "Windows" :exit t)
      ("Move"
       (("v" nc/maximize-or-split-window-vertically "Maximize or Split Window V")
        ("h" nc/split-window-horizontally "Split Window H"))))
#+end_src

*** hydra org-mode
#+begin_src emacs-lisp
  (major-mode-hydra-define org-mode nil
    ("GTD"
     (("d" nc/org-insert-daily-review "Start Daily Review")
      ("h" nc/insert-daily-heading "Insert Daily Heading"))
     "Actions"
     (("r" nc/org-refile-subtree-to-file "Refile subtree to file")
      ("A" nc/create-buffer-attachment-directory "Create attachment directory"))
     "Search"
     (("sn" nc/search-notes "Search Notes"))))
#+end_src

** My Personal Key Bindings
My map
#+begin_src emacs-lisp
  (defcustom nc-prefix "C-<"
    "Prefix for all personal keybinds."
    :type 'string
    :group 'nc-emacs)

  (bind-keys
     :prefix-map nc-map
     :prefix-docstring "Prefix for personal key bindings"
     :prefix nc-prefix
   ;; 2013-03-31: http://stackoverflow.com/questions/3124844/what-are-your-favorite-global-key-bindings-in-emacs
     (";" . nc/goto-emacs-config)
     ("SPC" . major-mode-hydra)
     (":"  . avy-goto-char-timer)
     ("i" . nc-hydra-insert/body)
     ("g" . nc-hydra-goto/body)
     ("t" . nc-hydra-toggle/body)
     ("w" . nc-hydra-windows/body))
#+end_src

** Key Chords

#+begin_src emacs-lisp
  (use-package key-chord
    :init
    (key-chord-mode 1)
    (key-chord-define-global "FF" 'projectile-find-file)
    (key-chord-define-global "::" 'avy-goto-char-timer)
    (key-chord-define-global "GG" 'consult-ripgrep)  
    (key-chord-define-global "OO" 'consult-outline)
    (key-chord-define-global "DD" 'delete-region)
    (key-chord-define-global "??" 'nc/search-notes) 
    (key-chord-define-global "BB" 'beginning-of-buffer)
    (key-chord-define-global "JJ" 'crux-top-join-line)
    (key-chord-define-global "$$" 'end-of-buffer))
#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][Which Key]] is a minor mode for Emacs that displays the key bindings following
your currently entered incomplete command (a prefix) in a popup.

#+begin_src emacs-lisp
(use-package which-key
  :diminish
  :custom
  (which-key-separator " ")
  (which-key-prefix-prefix "+")
  :config
  (which-key-mode))
#+end_src
* Windows
:properties:
:header-args+: :tangle "./lisp/setup-windows.el"
:end:

Windows configuration module automatically tangled in =./lisp/setup-windows.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-windows.el --- Windows configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Ace Window
[[https://github.com/abo-abo/ace-window][ace-window]] Quickly switch and move windows

#+begin_src emacs-lisp
  (use-package ace-window
    :bind (([remap other-window] . ace-window))
    :config
    (setq aw-keys '(?q ?s ?d ?f ?g ?h ?j ?k ?l))
    ;; increase size face
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0))))))
 #+end_src

** Golden Ratio

 [[https://github.com/roman/golden-ratio.el][Golden Ratio]] resize automatically the windows you are working

 #+begin_src emacs-lisp
   (use-package golden-ratio
     :diminish t
     :init
     (golden-ratio-mode 1)
     :config
     (setq golden-ratio-extra-commands
           (append golden-ratio-extra-commands
                   '(ace-window))))

   (defun nc/toggle-golden-ratio ()
     "Toggle golden ratio for widescreen"
     (interactive)
     (setq golden-ratio-adjust-factor .8))
 #+end_src


** Split Window Horizontally

Bound to =<my-prefix-map> w h=.
#+begin_src emacs-lisp
  (defun nc/split-window-horizontally ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))
#+end_src


