emacs/.emacs.d/Readme.org
*** Babel languages

#+begin_src emacs-lisp
  (use-package ob-restclient)

  (setq org-plantuml-jar-path
        (expand-file-name "~/opt/lib/plantuml.jar"))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell . t)
     (awk .t)
     (python . t)
     (calc . t)
     (js . t)
     (plantuml . t)
     (dot . t)
     (java .t)
     (restclient . t)))

  (require 'ob-clojure)
#+end_src

#+RESULTS:

*** Editing source code
 I don't want to get distracted by the same code in the other window, so I want org src to use the current window.

 #+begin_src emacs-lisp
   (setq org-src-window-setup 'current-window)
 #+end_src
*** Evaluate code blocks without prompting
#+begin_src emacs-lisp
  (setq org-confirm-babel-evaluate nil)
#+end_src
*** Syntax highlight in source blocks
#+begin_src emacs-lisp
  (setq org-src-fontify-natively t)
#+end_src
** My Org Mode Utilities Functions
*** Manipulate hours/minutes in tables
From https://orgmode.org/worg/org-hacks.html#org0d09b33
#+begin_src emacs-lisp
(defun nc--org-time-string-to-seconds (s)
  "Convert a string HH:MM:SS to a number of seconds."
  (cond
   ((and (stringp s)
         (string-match "\\([0-9]+\\):\\([0-9]+\\):\\([0-9]+\\)" s))
    (let ((hour (string-to-number (match-string 1 s)))
          (min (string-to-number (match-string 2 s)))
          (sec (string-to-number (match-string 3 s))))
      (+ (* hour 3600) (* min 60) sec)))
   ((and (stringp s)
         (string-match "\\([0-9]+\\):\\([0-9]+\\)" s))
    (let ((min (string-to-number (match-string 1 s)))
          (sec (string-to-number (match-string 2 s))))
      (+ (* min 60) sec)))
   ((stringp s) (string-to-number s))
   (t s)))

(defun nc--org-time-seconds-to-string (secs)
  "Convert a number of seconds to a time string."
  (cond ((>= secs 3600) (format-seconds "%h:%.2m:%.2s" secs))
        ((>= secs 60) (format-seconds "%m:%.2s" secs))
        (t (format-seconds "%s" secs))))

(defmacro nc/with-time (time-output-p &rest exprs)
  "Evaluate an org-table formula, converting all fields that look
like time data to integer seconds.  If TIME-OUTPUT-P then return
the result as a time value."
  (list
   (if time-output-p 'nc--org-time-seconds-to-string 'identity)
   (cons 'progn
         (mapcar
          (lambda (expr)
            `,(cons (car expr)
                    (mapcar
                     (lambda (el)
                       (if (listp el)
                           (list 'with-time nil el)
                         (nc--org-time-string-to-seconds el)))
                     (cdr expr))))
          `,@exprs))))
#+end_src

*** Attachments folder
I'm not a big fan of =org-attachments= so I prefer to store all my
attachements in a subfolder *assets/buffer-name-sans-extension* that
correspond to current buffer I'm editing.

#+begin_src emacs-lisp
  (defun nc/create-buffer-attachment-directory ()
      "Create assets directory for org mode file"
    (interactive)
    (let ((assets-buffer-dir (file-name-sans-extension (buffer-name) )))
      (f-mkdir "assets" assets-buffer-dir)
      (message "Creation %s folder for current folder" assets-buffer-dir)))
#+end_src

*** Translate capital keywords to lowercase
From : https://github.com/tecosaur/emacs-config/blob/master/config.org#translate-capital-keywords-old-to-lower-case-new

#+begin_src emacs-lisp
  (defun nc/org-syntax-convert-keyword-case-to-lower ()
    "Convert all #+KEYWORDS to #+keywords."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (let ((count 0)
            (case-fold-search nil))
        (while (re-search-forward "^[ \t]*#\\+[A-Z_]+" nil t)
          (unless (s-matches-p "RESULTS" (match-string 0))
            (replace-match (downcase (match-string 0)) t)
            (setq count (1+ count))))
        (message "Replaced %d occurences" count))))
#+end_src
** Deft 

[[https://github.com/jrblevin/deft][Deft]] is an emacs mode for quickly searching (or editing) in his directory notes.

#+begin_src emacs-lisp
  (use-package deft
    :bind
    (("C-c n d" . deft))
    :config
    (setq deft-directory "~/notes"
          deft-recursive t
          deft-extensions '("org")
          deft-default-extension "org"
          deft-text-mode 'org-mode
          deft-org-mode-title-prefix t
          deft-use-filter-string-for-filename t
          deft-auto-save-interval 0
          deft-recursive-ignore-dir-regexp
          (concat "\\(?:"
                  "\\."
                  "\\|\\.\\."
                  "\\\|valtech"
                  "\\|journal"
                  "\\)$")
          deft-file-naming-rules
          '((noslash . "-")
            (nospace . "-")
            (case-fn . downcase)))

    ;; With Org-roam V2, we need to adapt Deft Title
    ;; Cf https://github.com/jrblevin/deft/issues/75#issuecomment-905031872
    (defun nc/deft-parse-title (file contents)
      "Parse the given FILE and CONTENTS and determine the title.
    If `deft-use-filename-as-title' is nil, the title is taken to
    be the first non-empty line of the FILE.  Else the base name of the FILE is
    used as title."
      (let ((begin (string-match "^#\\+[tT][iI][tT][lL][eE]: .*$" contents)))
        (if begin
            (string-trim (substring contents begin (match-end 0)) "#\\+[tT][iI][tT][lL][eE]: *" "[\n\t ]+")
          (deft-base-filename file))))

    (advice-add 'deft-parse-title :override #'nc/deft-parse-title))
#+end_src

** Yankpad

[[https://github.com/Kungsgeten/yankpad][Yankpad]] paste snippets from an org-mode file.

#+begin_src emacs-lisp
    (use-package yankpad    
      :init
      (setq yankpad-file (concat org-directory "/templates/yankpad.org"))
      :config
      ;; If you want to complete snippets using company-mode
      ;; (add-to-list 'company-backends 'company-yankpad)
      ;; If you want to expand snippets with hippie-expand
      (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand))
#+end_src
** Org Roam

#+begin_src emacs-lisp

  ;; (when is-windows  
  ;;   (add-to-list 'exec-path "C:/ProgramJava/tools/sqlite-tools-win32-x86-3340100"))

  ;; From https://baty.net/2022/searching-org-roam-files/
  (defun nc/search-roam ()
    "Run consult-ripgrep on the org roam directory"
    (interactive)
    (consult-ripgrep (concat org-directory "/slipbox") nil))

  (use-package org-roam
    :after org
    :custom
    (org-roam-directory (concat org-directory "/slipbox"))
    :init
    (setq org-roam-v2-ack t)
    :bind
    ("C-c n l" . org-roam-buffer-toggle)
    ("C-c n f" . org-roam-node-find)
    ("C-c n r" . org-roam-node-random)
    ("C-c n s" . nc/search-roam)
    (:map org-mode-map
          (("C-c n i" . org-roam-node-insert)))
    :config

    (setq org-roam-capture-templates '(("d" "default" plain "%?"
                                        :if-new
                                        (file+head "%<%Y-%m-%d--%H-%M>--${slug}.org"
                                                   "#+title: ${title}\n#+date: %u\n\n")
                                        :unnarrowed t
                                        :immediate-finish t))
          )

    ;; Orgnaize org roam notes
    ;; Adapted from https://jethrokuan.github.io/org-roam-guide/
    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE."
      (condition-case nil
          (file-name-nondirectory
           (directory-file-name
            (file-name-directory
             (file-relative-name (org-roam-node-file node) org-roam-directory))))
        (error "main")))

    (setq org-roam-node-display-template
          (concat "${type:15} ${title:*} " (propertize "${tags:15}" 'face 'org-tag)))

    ;; this sets up various file handling hooks so your DB remains up to date
    (org-roam-setup))
#+end_src
* Programming
:properties:
:header-args+: :tangle "./lisp/setup-programming.el"
:end:

Programming configuration module automatically tangled in =./lisp/setup-programming.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-programming.el --- Programming configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** LSP Mode

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands lsp
    :bind-keymap ("C-c l" . lsp-command-map)
    :bind
      (:map lsp-mode-map
            ( ;;("C-\M-b" . lsp-find-implementation)
             ("M-RET" . lsp-execute-code-action)))
    :hook (lsp-mode . (lambda ()
                        (let ((lsp-keymap-prefix "C-c l"))
                          (lsp-enable-which-key-integration))))
    :config
    (setq ; recommended
          gc-cons-threshold (* 100 1024 1024)
          read-process-output-max (* 1024 1024))

    (setq ; optional
          ;; lsp-clojure-custom-server-command '("/Users/nchapon/_PIM/tmp/2del/clojure-lsp") 

          ; Features
          lsp-lens-enable t
          ;lsp-semantic-tokens-enable t

          lsp-headerline-breadcrumb-enable nil ;; disable breadcrumb


          ;; Conflicts with other Clojure emacs packages
          cljr-add-ns-to-blank-clj-files nil ; disable clj-refactor adding ns to blank files
          cider-eldoc-display-for-symbol-at-point nil ; disable cider eldoc integration
          ; lsp-eldoc-enable-hover nil ; disable lsp-mode showing eldoc during symbol at point
          ; lsp-enable-indentation nil ; uncomment to use cider indentation instead of lsp
          ; lsp-enable-completion-at-point nil ; uncomment to use cider completion instead of lsp

          ;; Terraform
          lsp-disabled-clients '(tfls)

          ))

  ;; optionally
  (use-package lsp-ui
    :hook lsp-mode
    :init
    ;; (setq lsp-ui-doc-alignment 'frame
    ;;       lsp-ui-doc-position  'bottom
    ;;       lsp-ui-doc-use-childframe nil)
    :config
    ;; WORKAROUND Hide mode-line of the lsp-ui-imenu buffer
    ;; @see https://github.com/emacs-lsp/lsp-ui/issues/243
    (defadvice lsp-ui-imenu (after hide-lsp-ui-imenu-mode-line activate)
      (setq mode-line-format nil))
    :bind (:map lsp-ui-mode-map
                (([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
                 ([remap xref-find-references] . lsp-ui-peek-find-references)))
    )

  (use-package lsp-treemacs
    :commands lsp-treemacs-errors-list)
#+end_src

This function adds the hooks that will enable LSP-powered formatting
and import organizing when saving a file with code.

#+begin_src elisp
  (defun lsp-save-hooks () "Install save hooks for lsp."
         (add-hook 'before-save-hook #'lsp-format-buffer t t)
         (add-hook 'before-save-hook #'lsp-organize-imports t t))
#+end_src

** Parenthesis
*** Smart Parens
Smart parens for all programming modes with paredit bindings.

#+begin_src emacs-lisp
  (use-package smartparens
    :defer t
    :diminish ""
    :hook (((clojure-mode
             emacs-lisp-mode
             common-lisp-mode
             scheme-mode
             lisp-mode
             cider-repl-mode
             inferior-lisp-mode
             inferior-emacs-lisp-mode)
            . smartparens-strict-mode)
           (prog-mode . smartparens-mode))

    :bind (:map smartparens-mode-map
                ("C-M-q" . sp-indent-defun)
                :map smartparens-strict-mode-map
                (";" . sp-comment))

    :config
    (require 'smartparens-config)
    (sp-use-paredit-bindings)
    (define-key smartparens-mode-map (kbd "M-r") 'sp-rewrap-sexp) ; needs to be set manually, because :bind section runs before config
    (setq smartparens-strict-mode t)
    (sp-local-pair 'emacs-lisp-mode "`" nil :when '(sp-in-string-p))

    (defun nc--create-newline-and-enter-sexp (&rest _ignored)
      "Open a new brace or bracket expression, with relevant newlines and indent. "
      (newline)
      (indent-according-to-mode)
      (forward-line -1)
      (indent-according-to-mode))

    (sp-with-modes '(c-mode c++-mode js-mode js2-mode java-mode
                            typescript-mode perl-mode)
      (sp-local-pair "{" nil :post-handlers
                     '((nc--create-newline-and-enter-sexp "RET")))))

#+end_src

*** Show Paren Mode
Emacs builtin show paren mode.
#+begin_src emacs-lisp
  (use-package paren
    :straight nil
    :hook (prog-mode . show-paren-mode)
    :custom
    (show-paren-delay 0)
    (show-paren-when-point-in-periphery t))
#+end_src



** Clojure
