emacs/.emacs.d/lisp/setup-programming.el

(use-package lsp-mode
  :commands lsp
  :bind-keymap ("C-c l" . lsp-command-map)
  :bind
    (:map lsp-mode-map
          ( ;;("C-\M-b" . lsp-find-implementation)
           ("M-RET" . lsp-execute-code-action)))
  :hook (lsp-mode . (lambda ()
                      (let ((lsp-keymap-prefix "C-c l"))
                        (lsp-enable-which-key-integration))))
  :config
  (setq ; recommended
        gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024))

  (setq ; optional
        ;; lsp-clojure-custom-server-command '("/Users/nchapon/_PIM/tmp/2del/clojure-lsp") 

        ; Features
        lsp-lens-enable t
        lsp-semantic-tokens-enable t

        lsp-headerline-breadcrumb-enable nil ;; disable breadcrumb


        ;; Conflicts with other Clojure emacs packages
        cljr-add-ns-to-blank-clj-files nil ; disable clj-refactor adding ns to blank files
        cider-eldoc-display-for-symbol-at-point nil ; disable cider eldoc integration
        ; lsp-eldoc-enable-hover nil ; disable lsp-mode showing eldoc during symbol at point
        ; lsp-enable-indentation nil ; uncomment to use cider indentation instead of lsp
        ; lsp-enable-completion-at-point nil ; uncomment to use cider completion instead of lsp
        ))

;; optionally
(use-package lsp-ui
  :commands lsp-ui-mode
  :init
  (setq lsp-ui-doc-alignment 'frame
        lsp-ui-doc-position  'bottom
        lsp-ui-doc-use-childframe nil)
  :config
    ;; WORKAROUND Hide mode-line of the lsp-ui-imenu buffer
    ;; @see https://github.com/emacs-lsp/lsp-ui/issues/243
    (defadvice lsp-ui-imenu (after hide-lsp-ui-imenu-mode-line activate)
      (setq mode-line-format nil))
  )

(use-package lsp-treemacs
  :commands lsp-treemacs-errors-list)

(defun lsp-save-hooks () "Install save hooks for lsp."
       (add-hook 'before-save-hook #'lsp-format-buffer t t)
       (add-hook 'before-save-hook #'lsp-organize-imports t t))

(use-package smartparens
  :defer t
  :diminish ""
  :hook (((clojure-mode
           emacs-lisp-mode
           common-lisp-mode
           scheme-mode
           lisp-mode
           cider-repl-mode
           inferior-lisp-mode
           inferior-emacs-lisp-mode)
          . smartparens-strict-mode)
         (prog-mode . smartparens-mode))

  :bind (:map smartparens-mode-map
              ("C-M-q" . sp-indent-defun)
              :map smartparens-strict-mode-map
              (";" . sp-comment))

  :config
  (require 'smartparens-config)
  (sp-use-paredit-bindings)
  (define-key smartparens-mode-map (kbd "M-r") 'sp-rewrap-sexp) ; needs to be set manually, because :bind section runs before config
  (setq smartparens-strict-mode t)
  (sp-local-pair 'emacs-lisp-mode "`" nil :when '(sp-in-string-p))

  (defun nc--create-newline-and-enter-sexp (&rest _ignored)
    "Open a new brace or bracket expression, with relevant newlines and indent. "
    (newline)
    (indent-according-to-mode)
    (forward-line -1)
    (indent-according-to-mode))

  (sp-with-modes '(c-mode c++-mode js-mode js2-mode java-mode
                          typescript-mode perl-mode)
    (sp-local-pair "{" nil :post-handlers
                   '((nc--create-newline-and-enter-sexp "RET")))))

(use-package paren
  :straight nil
  :hook (prog-mode . show-paren-mode)
  :custom
  (show-paren-delay 0)
  (show-paren-when-point-in-periphery t))
