emacs/.emacs.d/Readme.org
*** clojure-mode
#+begin_src emacs-lisp
  (use-package clojure-mode
    :hook
    ((clojure-mode . lsp)
     (clojurec-mode . lsp)
     (clojurescript-mode . lsp)
     (clojure-mode . lsp-save-hooks))
    :init
    (setq clojure-align-forms-automatically t))
#+end_src
*** Cider
My custom rebinding =C-c C-p= to =cider-pprint-eval-last-sexp-to-comment=
#+begin_src emacs-lisp
  (use-package cider
    :init
    (setq org-babel-clojure-backend 'cider)
    :bind ([remap cider-pprint-eval-last-sexp] . cider-pprint-eval-last-sexp-to-comment))
#+end_src

** Docker
#+begin_src emacs-lisp
(use-package dockerfile-mode
  :mode "Dockerfile.*\\'")
#+end_src
** Go
#+begin_src emacs-lisp
  (use-package go-mode)
#+end_src
** Lua
#+begin_src emacs-lisp
(use-package lua-mode
  :mode "\\.lua\\'")
#+end_src
** Markdown

GitHub Flavored Markdown by default for README.md files.

#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'"       . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :config

    (setq markdown-fontify-code-blocks-natively t)
  
    ;; Process Markdown with Pandoc, using GitHub stylesheet for nice output
    (let ((stylesheet (expand-file-name
                       (locate-user-emacs-file "etc/pandoc.css"))))
      (setq markdown-command
            (mapconcat #'shell-quote-argument
                       `("pandoc" "--toc" "--section-divs"
                         "--css" ,(concat "file://" stylesheet)
                         "--standalone" "-f" "markdown" "-t" "html5")
                       " "))))


  (use-package markdown-toc
    :after markdown-mode)

#+end_src
** Python
#+begin_src emacs-lisp
(use-package python-mode
  :straight nil
  :mode ("\\.py\\'")
  :custom
  (python-shell-interpreter "python3"))

#+end_src
** Terraform

Needs Terraform LSP Server, not the latest version, works fine with =0.28.1=

#+begin_src shell :tangle no
    asdf plugin add terraform-ls
  asdf install terraform-ls 0.28.1
  asdf global terraform-ls 0.28.1
#+end_src

#+begin_src emacs-lisp
  (use-package terraform-mode
    :hook ((terraform-mode . lsp)))
#+end_src
** Web
*** Rest Client
[[https://github.com/pashky/restclient.el][Restclient]] Emacs client for testing API

#+begin_src emacs-lisp
(use-package restclient
  :mode (("\\.restclient\\'" . restclient-mode)
         ("\\.http\\'" . restclient-mode)))
#+end_src
*** Web Mode
[[https://web-mode.org/][Web Mode]] major mode for editing HTML pages

#+begin_src emacs-lisp
(use-package web-mode
  :mode (("\\.html\\'" . web-mode)
         ("\\.hbs\\'" . web-mode)
         ("\\.tag$" . web-mode)
         ("\\.ftl$" . web-mode)
         ("\\.jsp$" . web-mode)
         ("\\.php$" . web-mode))
  :config
  (add-hook 'web-mode-hook (lambda ()
                             (setq web-mode-markup-indent-offset 4)
                             (setq web-mode-code-indent-offset 4))))

#+end_src

*** Javascript
[[https://github.com/mooz/js2-mode][JS2 mode]] improved javascript editing mode
#+begin_src emacs-lisp
(use-package js2-mode
  :mode "\\.js\\'"
  :init
  (defalias 'javascript-generic-mode 'js2-mode)
  :config
  (js2-imenu-extras-setup)
  (setq-default js-auto-indent-flag nil
                js2-strict-missing-semi-warning nil
                js-indent-level 2)

  ;; Don't override global M-j keybinding (join lines)
  (define-key js2-mode-map (kbd "M-j") nil))

#+end_src


** YAML

#+begin_src emacs-lisp
  (use-package yaml-mode
    :mode (("\\.yaml\\'" . yaml-mode)
             ("\\.yml\\'" . yaml-mode))
    :custom
    (yaml-indent-offset 4))
#+end_src


* Shell
:properties:
:header-args+: :tangle "./lisp/setup-shell.el"
:end:

Shell configuration module automatically tangled in =./lisp/setup-shell.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-shell.el --- Shell configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** vterm 

Last emacs terminal emulator :  https://github.com/akermu/emacs-libvterm

[[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the Vterm buffer and the current editing buffer 

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :custom
    (vterm-disable-bold-font t)
    (vterm-disable-inverse-video nil)
    (vterm-disable-underline nil)
    (vterm-kill-buffer-on-exit t)
    (vterm-max-scrollback 9999)
    (vterm-shell "/bin/zsh")
    (vterm-term-environment-variable "xterm-256color"))

  (use-package vterm-toggle
    :custom
    ;; Show Vterm Buffer in bottom side
    (vterm-toggle-fullscreen-p nil)
  
    :config
    (add-to-list 'display-buffer-alist
       '("\*vterm\*"
         (display-buffer-in-side-window)
         (window-height . 0.3)
         (side . bottom)
         (slot . 0)))

    :bind
    ("C-c t" . vterm-toggle)
    (:map vterm-mode-map
          ("C-<return>" . vterm-toggle-insert-cd)
          ("C-S-n" . vterm-toggle-forward)
          ("C-S-p" . vterm-toggle-backward)
          ))
#+end_src

** Eshell

Adapted from https://config.daviwil.com/emacs#eshell 

#+begin_src emacs-lisp
  (defun nc/map-line-to-status-char (line)
    (cond ((string-match "^?\\? " line) "?")))

  (defun nc/get-git-status-prompt ()
    (let ((status-lines (cdr (process-lines "git" "status" "--porcelain" "-b"))))
      (seq-uniq (seq-filter 'identity (mapcar 'nc/map-line-to-status-char status-lines)))))

  (defun nc/get-prompt-path ()
    (let* ((current-path (eshell/pwd))
           (git-output (shell-command-to-string "git rev-parse --show-toplevel"))
           (has-path (not (string-match "^fatal" git-output))))
      (if (not has-path)
        (abbreviate-file-name current-path)
        (string-remove-prefix (file-name-directory git-output) current-path))))

  ;; This prompt function mostly replicates my custom zsh prompt setup
  ;; that is powered by github.com/denysdovhan/spaceship-prompt.
  (defun nc/eshell-prompt ()
    (let ((current-branch (magit-get-current-branch))
          )
      (concat
       "\n"
       (propertize (system-name) 'face `(:foreground "#62aeed"))
       (propertize " > " 'face `(:foreground "white"))
       (propertize (nc/get-prompt-path) 'face `(:foreground "#82cfd3"))
       (when current-branch
         (concat
          (propertize " • " 'face `(:foreground "white"))
          (propertize (concat " " current-branch) 'face `(:foreground "#c475f0"))))

       (propertize " • " 'face `(:foreground "white"))
       (propertize (format-time-string "%I:%M:%S %p") 'face `(:foreground "#5a5b7f"))
       (if (= (user-uid) 0)
           (propertize "\n#" 'face `(:foreground "red2"))
         (propertize "\nλ" 'face `(:foreground "#aece4a")))
       (propertize " " 'face `(:foreground "white")))))

  (defun nc/eshell-configure ()

    (use-package xterm-color)

    (push 'eshell-tramp eshell-modules-list)
    (push 'xterm-color-filter eshell-preoutput-filter-functions)
    (delq 'eshell-handle-ansi-color eshell-output-filter-functions)

    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    (add-hook 'eshell-before-prompt-hook
              (lambda ()
                (setq xterm-color-preserve-properties t)))

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; We want to use xterm-256color when running interactive commands
    ;; in eshell but not during other times when we might be launching
    ;; a shell command to gather its output.
    (add-hook 'eshell-pre-command-hook
              (lambda () (setenv "TERM" "xterm-256color")))
    (add-hook 'eshell-post-command-hook
              (lambda () (setenv "TERM" "dumb")))

    ;; Use completion-at-point to provide completions in eshell
    (define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)
    (define-key eshell-mode-map (kbd "C-r") 'consult-history)

    ;; Visual Commands
    (require 'em-term)
    (setq eshell-visual-commands '("vi" "screen" "top" "less" "more" "lynx"
                                   "ncftp" "pine" "tin" "trn" "elm" "htop" "node" "npm")
          eshell-visual-subcommands '(("git" "log" "diff" "show")))

    ;; Initialize the shell history
    (eshell-hist-initialize)

    (setenv "PAGER" "cat")

    (setq eshell-prompt-function      'nc/eshell-prompt
          eshell-prompt-regexp        "^λ "
          eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-highlight-prompt t
          eshell-scroll-to-bottom-on-input t
          eshell-prefer-lisp-functions nil))

  (use-package eshell
    :after esh-mode
    :hook (eshell-first-time-mode . nc/eshell-configure)

    :config

    (defun nc/eshell-clear-buffer ()
      "Clear terminal"
      (interactive)
      (let ((inhibit-read-only t))
        (erase-buffer)
        (eshell-send-input)))


    (defun nc/eshell-quit-or-delete-char (arg)
      (interactive "p")
      (if (and (eolp) (looking-back eshell-prompt-regexp))
          (progn
            (eshell-life-is-too-much) ; Why not? (eshell/exit)
            (ignore-errors
              (delete-window)))
        (delete-forward-char arg)))

    :bind
    (:map eshell-mode-map
          ("C-d" . nc/eshell-quit-or-delete-char)
          ("C-l" . nc/eshell-clear-buffer))

    )
#+end_src


*** eshell-toggle


#+begin_src emacs-lisp
  (use-package eshell-toggle
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil))
#+end_src
* Custom Functions
:properties:
:header-args+: :tangle "./lisp/setup-functions.el"
:end:

Custom functions module automatically tangled in =./lisp/setup-functions.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-functions.el --- Custom functions module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Emacs Config File

 #+begin_src emacs-lisp
   (defun nc/goto-emacs-config ()
       "Edit Readme.org"
       (interactive)
       (find-file "~/.emacs.d/Readme.org"))     
 #+end_src

** My personal credentials

#+begin_src emacs-lisp
    (defun nc/goto-my-credentials ()
      "Goto my credentials"
      (interactive)
      ;; before disable super-save-mode
      ;;(super-save-stop)
      (find-file (concat nc/org-default-personal-dir "/password.gpg")))
#+end_src


** Pseudo uuid

Generate a 32 random pseudo uuid

#+begin_src emacs-lisp
  (defun nc--random-alnum ()
    (let* ((alnum "abcdef0123456789")
           (i (% (abs (random)) (length alnum))))
      (substring alnum i (1+ i))))

  (defun nc/uuid ()
    "Generate a pseudo UUID"
    (interactive)
    (dotimes (i 32) (insert (nc--random-alnum))))
#+end_src


** Password generator
Generates a strong password

 #+begin_src emacs-lisp
   (defun nc--random-char ()
       (let* ((alnum "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-/%+*?&#[]()={}_<>!$,;:^µ0123456789")
              (i (% (abs (random)) (length alnum))))
         (substring alnum i (1+ i))))


   (defun nc/generate-password ()
       "Generates a strong password"
       (interactive)
       (dotimes (i 12) (insert (nc--random-char))))
 #+end_src

** TimeSlot
Insert time slot mainly used when I schedule meeting or appointment.
#+begin_src emacs-lisp
  (defvar current-hour-format "%H:00")

  (defun nc/insert-time-slot ()
    "Insert Time Slot"
    (interactive)
    (let ((begin (format-time-string current-hour-format (current-time)))
          (end (format-time-string current-hour-format (time-add (current-time) (seconds-to-time 3600)))))
      (insert (concat begin "-" end))))
#+end_src

** Inserting time stamps
   From : https://github.com/novoid/dot-emacs/blob/master/config.org#inserting-time-stamps--my-map-ddtt

#+begin_src emacs-lisp
  (defun nc/insert-datestamp ()
    "Insert the current date in yyyy-mm-dd format."
    (interactive "*")
    (if (eq major-mode 'org-mode)
        (progn
          (org-insert-time-stamp nil nil nil)
          (insert " "))
        (insert (format-time-string "%Y-%m-%d" (current-time)))))
 #+end_src


 #+begin_src emacs-lisp
   (defun nc/insert-datestamp-inactive ()
     "Insert the current date in yyyy-mm-dd format."
     (interactive "*")
     (if (eq major-mode 'org-mode)
         (progn
       (org-insert-time-stamp nil nil t)
       (insert " "))
       (insert (format-time-string "%Y-%m-%d" (current-time)))))
 #+end_src

** Searching in my notes

#+begin_src emacs-lisp
  (defun nc/search-notes ()
    "Search in all my org notes"
    (interactive)
    (consult-ripgrep org-directory ""))
#+end_src

** Sudo Edit File

From : https://karthinks.com/software/fifteen-ways-to-use-embark/

#+begin_src emacs-lisp
      (defun nc/sudo-find-file (file)
        "Open FILE as root."
        (interactive "FOpen file as root: ")
        (when (file-writable-p file)
          (user-error "File is user writeable, aborting sudo"))
        (find-file (if (file-remote-p file)
                       (concat "/" (file-remote-p file 'method) ":"
                               (file-remote-p file 'user) "@" (file-remote-p file 'host)
                               "|sudo:root@"
                               (file-remote-p file 'host) ":" (file-remote-p file 'localname))
                     (concat "/sudo:root@localhost:" file))))
#+end_src
* Provided modules

** =setup-prefs= module
#+begin_src emacs-lisp :tangle ./lisp/setup-prefs.el
  (provide 'setup-prefs)
  ;;; setup-prefs.el ends here
#+end_src


