emacs/.emacs.d/Readme.org
** =setup-ui= module
#+begin_src emacs-lisp :tangle ./lisp/setup-ui.el
  (provide 'setup-ui)
  ;;; setup-ui.el ends here
#+end_src


** =setup-keys= module
#+begin_src emacs-lisp :tangle ./lisp/setup-keys.el
  (provide 'setup-keys)
  ;;; setup-keys.el ends here
#+end_src

** =setup-windows= module
#+begin_src emacs-lisp :tangle ./lisp/setup-windows.el
  (provide 'setup-windows)
  ;;; setup-windows.el ends here
#+end_src



** =setup-core= module
#+begin_src emacs-lisp :tangle ./lisp/setup-core.el
  (provide 'setup-core)
  ;;; setup-core.el ends here
#+end_src
** =setup-completion= module
#+begin_src emacs-lisp :tangle ./lisp/setup-completion.el
  (provide 'setup-completion)
  ;;; setup-completion.el ends here
#+end_src


** =setup-org= module
#+begin_src emacs-lisp :tangle ./lisp/setup-org.el
  (provide 'setup-org)
  ;;; setup-org.el ends here
#+end_src

** =nc-programming= module
#+begin_src emacs-lisp :tangle ./lisp/setup-programming.el
  (provide 'setup-programming)
  ;;; setup-programming.el ends here
#+end_src


** =setup-shell= module
#+begin_src emacs-lisp :tangle ./lisp/setup-shell.el
  (provide 'setup-shell)
  ;;; setup-shell.el ends here
#+end_src

** =setup-functions= module
#+begin_src emacs-lisp :tangle ./lisp/setup-functions.el
  (provide 'setup-functions)
  ;;; setup-functions.el ends here
#+end_src


# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
# End:
