emacs/.emacs.d/lisp/setup-core.el

(provide 'setup-core)
;;; setup-core.el ends here
