emacs/.emacs.d/lisp/setup-keys.el

(provide 'setup-keys)
;;; setup-keys.el ends here
